# DBMS, 데이터 베이스 모델링

<br>

**테이블이란?**

데이터가 저장되는 기본단위

표현식으로  저장된 데이터의 집합

<br>

**테이블에서 column이란?**

각 개체가 가지고 있는 속성은 column이라고 한다.

<br>

**테이블에서 row이란?**

테이블에서 개체 하나하나를 나타내는 단위

<br>

**DBMS(DataBase Management System)?**

데이터베이스 관리 시스템

<br>

사용자의 명령에 따라 데이터를 새로만들거나

데이터 베이스안에 새로운 테이블을 만들 수 있게하는 등

이러한 작업들이 가능하게한다.

<br>

모든 DBMS는 SQL프로그래밍 언어로 데이터를 다룬다.

<br>

DBMS를 사용한다라는 것은

실행되고 있는 server에 client를 이용해서 접속한 후, 원하는 명령을 내린다는 뜻이다.

<br>

즉, 사용자는 클라이언트 역할을 하는 프로그램으로 해당 서버에 접속하고, 그 서버에 SQL을 전송해서 명령을 내리는 구조이다.

<br>

MySQL Workbench를 사용해서 server에 접속한 후, 원하는 데이터베이스 관련 작업을 할 수 있게한다.

<br>

CLI 환경이 아닌 GUI 환경에서 더 편하고 클라이언츠가 더 쉽게 작업할 수 있게해준다.

<br>

**데이터 베이스 모델링이란?**

<br>

데이터 베이스 모델링은 데이터 베이스에서의 **테이블 구조를 미리 계획** 해서 작성하는 작업이다. 

RDBMS는 **테이블간에 유기적으로 연결되어 있기 때문에** 모델링을 잘하는것이 중요한다.
기본적으로 **개념적 모델링, 논리적 모델링, 물리적 모델링 절차** 로 설계된다.

<br>

**개념적 모델링 이란?**

업무분석해서 핵심 데이터의 집합을 정의하는 과정

각각의 테이블의 중요한 데이터를 큰그림으로 정의한다.

<br>

**논리적 모델링 이란?**

개념적 모델링을 상세화 하는 과정

테이블의 상세데이터를 정의한다.

<br>

**물리적 모델링이란?**

논리적 모델링을 DBMS에 추가하기 위해 구체화 되는과정

논리적으로 정의한 값을 실제 적용히려는 물리적으로 정의한다.

<br>

**모델링 하는 방법**

물리적 모델링을 가능하게한다.

![데이터베이스 모델링](../Images/데이터%20베이스%20모델링/데이터베이스_모델링-1.jpg)

<br>

Table Name을 변경한다.

![데이터베이스 모델링](../Images/데이터%20베이스%20모델링/데이터베이스_모델링-2.jpg)

<br>

태이블을 만들어준다.

![데이터베이스 모델링](../Images/데이터%20베이스%20모델링/데이터베이스_모델링-3.jpg)

<br>

만든 테이블을 더블클릭으로 column Name을 설정해준다

테이블별로 상태를 연결해준다

![데이터베이스 모델링](../Images/데이터%20베이스%20모델링/데이터베이스_모델링-4.jpg)

<br>

Reverse Engineer눌러 데이터 베이스를 다이어그램으로 변경한다.

![데이터베이스 모델링](../Images/데이터%20베이스%20모델링/데이터베이스_모델링-5.jpg)
